Autodesk.Revit.DB.DimensionStyleType
An enumerated type containing possible style types of dimensions.

Autodesk.Revit.DB.DimensionStyleType.Diameter
Diameter dimension.

Autodesk.Revit.DB.DimensionStyleType.SpotSlope
SpotSlope

Autodesk.Revit.DB.DimensionStyleType.LinearFixed
LinearFixed dimension, which is linear dimension whose direction is parallel to X or Y.

Autodesk.Revit.DB.DimensionStyleType.SpotCoordinate
SpotCoordinate

Autodesk.Revit.DB.DimensionStyleType.SpotElevation
SpotElevation

Autodesk.Revit.DB.DimensionStyleType.ArcLength
ArcLength dimension.

Autodesk.Revit.DB.DimensionStyleType.Radial
Radial dimension.

Autodesk.Revit.DB.DimensionStyleType.Angular
Angular dimension.

Autodesk.Revit.DB.DimensionStyleType.Linear
Linear dimension.